Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_MVVNL.c
// em_display.c
// Driver layer 
#include "r_cg_macrodriver.h"
#include "typedef.h"            /* GCSE Standard definitions */
#include "r_cg_wdt.h"
#include "r_cg_rtc.h"
#include "r_cg_sau.h"           /* CG Serial Driver */
#include "emeter3_structs.h"

// Application layer 
#include "platform.h"
#include "r_lcd_display.h"      /* LCD Display Application Layer */
#include "r_lcd_config.h"
#include "em_display.h"         /* EM Display Application Layer */
#include "event.h"
#include "powermgmt.h"
#include "pravakComm.h"
#include "emeter3_app.h"
#include "memoryOps.h"
#include "e2rom.h"
#include "tampers.h"
#include "utilities.h"

// Display tamper condition
#include "format.h"
#include "eeprom.h"
#include "em_core.h"



const uint8_t msg_nil_tamper[8] = {LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CHAR_N, LCD_CHAR_I, LCD_CHAR_L, LCD_CLEAR_DIGIT};
const uint8_t msg_miss_R[8]     = {LCD_CHAR_M, 1, 5, 5, LCD_CHAR_P, LCD_MINUS_SIGN, LCD_CHAR_R, LCD_CLEAR_DIGIT};
const uint8_t msg_miss_Y[8]     = {LCD_CHAR_M, 1, 5, 5, LCD_CHAR_P, LCD_MINUS_SIGN, LCD_CHAR_Y, LCD_CLEAR_DIGIT};
const uint8_t msg_miss_B[8]     = {LCD_CHAR_M, 1, 5, 5, LCD_CHAR_P, LCD_MINUS_SIGN, LCD_CHAR_B, LCD_CLEAR_DIGIT};
const uint8_t msg_over_V[8]     = {LCD_CHAR_O, LCD_CHAR_V, LCD_CHAR_E, LCD_CHAR_R, LCD_MINUS_SIGN, LCD_CHAR_V, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t msg_under_V[8]    = {LCD_CHAR_U, LCD_CHAR_N, LCD_CHAR_D, LCD_CHAR_E, LCD_CHAR_R, LCD_MINUS_SIGN, LCD_CHAR_V, LCD_CLEAR_DIGIT};
const uint8_t msg_unbal_V[8]    = {LCD_CHAR_V, LCD_MINUS_SIGN, LCD_CHAR_U, LCD_CHAR_N, LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_L, LCD_CLEAR_DIGIT};
const uint8_t curr_rev_R[8]    = {LCD_CHAR_C, LCD_CLEAR_DIGIT, LCD_CHAR_R, LCD_CHAR_E, LCD_CHAR_V, LCD_MINUS_SIGN, LCD_CHAR_R, LCD_CLEAR_DIGIT};
const uint8_t curr_rev_Y[8]    = {LCD_CHAR_C, LCD_CLEAR_DIGIT, LCD_CHAR_R, LCD_CHAR_E, LCD_CHAR_V, LCD_MINUS_SIGN, LCD_CHAR_Y, LCD_CLEAR_DIGIT};
const uint8_t curr_rev_B[8]    = {LCD_CHAR_C, LCD_CLEAR_DIGIT, LCD_CHAR_R, LCD_CHAR_E, LCD_CHAR_V, LCD_MINUS_SIGN, LCD_CHAR_B, LCD_CLEAR_DIGIT};
const uint8_t curr_fail_R[8]    = {LCD_CHAR_C, LCD_CHAR_F, LCD_CHAR_A, 1, LCD_CHAR_L, LCD_MINUS_SIGN, LCD_CHAR_R, LCD_CLEAR_DIGIT};
const uint8_t curr_fail_Y[8]    = {LCD_CHAR_C, LCD_CHAR_F, LCD_CHAR_A, 1, LCD_CHAR_L, LCD_MINUS_SIGN, LCD_CHAR_Y, LCD_CLEAR_DIGIT};
const uint8_t curr_fail_B[8]    = {LCD_CHAR_C, LCD_CHAR_F, LCD_CHAR_A, 1, LCD_CHAR_L, LCD_MINUS_SIGN, LCD_CHAR_B, LCD_CLEAR_DIGIT};
const uint8_t msg_unbal_C[8]    = {LCD_CHAR_C, LCD_MINUS_SIGN, LCD_CHAR_U, LCD_CHAR_N, LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_L, LCD_CLEAR_DIGIT};
const uint8_t msg_bypass_C[8]    = {LCD_CHAR_C, LCD_CHAR_B, LCD_CHAR_Y, LCD_CHAR_P, LCD_CHAR_A, 5, 5, LCD_CLEAR_DIGIT};
const uint8_t msg_over_C[8]     = {LCD_CHAR_O, LCD_CHAR_V, LCD_CHAR_E, LCD_CHAR_R, LCD_MINUS_SIGN, LCD_CHAR_C, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t msg_C_Open[8]     = {LCD_CHAR_C, LCD_MINUS_SIGN, LCD_CHAR_O, LCD_CHAR_P, LCD_CHAR_E, LCD_CHAR_N, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t msg_Magnet[8]     = {LCD_CHAR_M, LCD_CHAR_A, LCD_CHAR_G, LCD_CHAR_N, LCD_CHAR_E, LCD_CHAR_T, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t msg_ND[8]     = {LCD_CHAR_N, LCD_MINUS_SIGN, LCD_CHAR_D, 1, 5, LCD_CHAR_T, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t Bat_OK[8]     = {LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_T, LCD_MINUS_SIGN, LCD_CHAR_G, LCD_CHAR_D, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t Bat_LO[8]     = {LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_T, LCD_MINUS_SIGN, LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_D, LCD_CLEAR_DIGIT};



// In the definition of TAMPER_DISPLAY_MASK event code bits 1 to 15 have been accounted for by 0x0000FFFE
// the other bits are separately and individually accounted
#define TAMPER_DISPLAY_MASK	(0x0000FFFE | MAGNET_MASK | AC_MAGNET_MASK | NEUTRAL_DISTURBANCE_MASK | OVER_CURRENT_Y_MASK | OVER_CURRENT_B_MASK)
void displayTamperName(uint8_t eventCode);
void d_Tampers(void);


void handleDisplay_Production(void);
void display_autoScroll_Production(void);



void display_autoScroll(void);
void display_onDemand(void);
void display_Third(void);

void EM_LCD_DisplayPOR(void);

void EM_DisplayDate(void);
void EM_DisplayInstantTime(void);

void EM_LCD_DisplayStatus(void);

uint8_t BCD2DEC(uint8_t BCD_number);

// utility icon functions
void LCD_DisplaykWSign(void);
void LCD_DisplaykVASign(void);
void LCD_DisplaykVArSign(void);
void LCD_DisplaykWhSign(void);
void LCD_DisplaykVAhSign(void);
void LCD_DisplaykVArhSign(void);
void lcd_display_date(uint8_t dat, uint8_t mth, uint8_t yr);
void lcd_display_time(uint8_t hr, uint8_t min, uint8_t sec);

#define RETURN_TO_AUTOSCROLL_COUNT	7500	// corresponds to 300 seconds or 5 minutes

#ifdef BIDIR_METER
	#define NO_OF_SUB_DISPLAY_STATES 4	// BIDIR_METER has 4
#else
	#define NO_OF_SUB_DISPLAY_STATES 3	// Regular Gujarat Meter has 3
#endif

uint8_t disp_state;
uint8_t disp_timer;
uint8_t disp_autoscroll_interval=10;
uint8_t holdState;


uint8_t			g_display_mode = 0;	// 0 - Autoscroll, 1- OnDemand, 2-ThirdDisplay, 3-Special Autoscroll
//uint8_t			g_display_update_type =0;	// 0 - Autoincrement, 1- OnKeyPressOnly, 2-AutoIncrementEverysecond, 3-KeyPressIncrementEverySecond
uint8_t     g_is_por = 0;

uint8_t gentimer;
uint8_t tamperTimer;

uint8_t comm_mode;
uint8_t commModeTimer;


uint8_t kbscanflag;
uint8_t keyPressedCtr;
uint16_t keyNotPressedCtr;

//uint8_t keyNotPressedCtr;
uint8_t keyPressedCtr1;
uint8_t keyNotPressedCtr1;

uint8_t keyPressedCtr2;
uint8_t keyNotPressedCtr2;

int16_t mode_timeout_ctr;
uint8_t	seconds_flag;
uint8_t sub_disp_state=255;
uint8_t avoidShowingRepeatParameters;
uint8_t alt_autoscroll_mode;
uint8_t autoscrollInButtonMode;
uint8_t displayHold;

int8_t scrollLock;

//int32_t testCounter;
//int16_t innerCounter;


//typedef void (* __far fp_display_t)(void);

void KEY_40msInterruptCallback(void)
{
	kbscanflag=1;
}

void makeDisplayReadyForAutoScroll(void)
{
		mode_timeout_ctr=0;
		avoidShowingRepeatParameters=0;
		g_display_mode=0;	//revert to autoscroll
		alt_autoscroll_mode=0;
		sub_disp_state=255;
		disp_state=255;
		disp_autoscroll_interval=10;
		autoscrollInButtonMode=0;
}

void EM_RTC_DisplayInterruptCallback(void)
{//this function is called only in battery mode
  powermgmt_mode_t power_mode;
	
