Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_MVVNL.c
	disp_timer++;
	gentimer++;

	if(displayHold!=0)
	{
		if(gentimer>3)
			displayHold=0;
	}
	
	seconds_flag=1;
	power_mode = POWERMGMT_GetMode();	// actual function to be used
	if (power_mode == POWERMGMT_MODE3)
	{
		gujaratSecondsCounter++;
		tamperTimer=0;
#ifdef KEY_ACTIVE_HIGH
		if(P13.7!=0)
#else
		if(P13.7==0)
#endif		
		{
			keyPressedCtr++;
			if(keyPressedCtr>4)
			{
				sleepCommMode=1;
				sleepCommModeTimer=0;
				comm_mode=1;
				commModeTimer=0;
//-------------				
// This is to start the communication module	
			  SAU0EN = 1U;
			  SAU1EN = 1U;
	
// We must also Vcc2 (P57) On
				P5 |=0x80;	// P57=1 - 1000 0000
	
// TXD3(P85) must be output, RXD3(P84) input - already the case
// P85 must be 1
				P8|=0x20;	// 0010 0000 

// IRTXD(P56) must be output, IRRXD(P55) input - already the case
// P56 must be 1
				P5 |=0x40;	// P56=1 - 0100 0000
				
			  R_UART2_Start();
				R_UART3_Start();
//-----------------		

				disp_timer = 0;
				scrollLock=1;	// lock the display for a few seconds to allow following message to remain on LCD
			// this variable gets cleared in 3 seconds	
				
			  LCD_ClearAll();
				LCD_DisplayDigit(1, LCD_CHAR_C);
				LCD_DisplayDigit(2, 0);
				LCD_DisplayDigit(3, LCD_CHAR_M);
				LCD_DisplayDigit(4, LCD_CHAR_M);
				LCD_DisplayDigit(5, LCD_MINUS_SIGN);
				LCD_DisplayDigit(6, 0);
				LCD_DisplayDigit(7, LCD_CHAR_N);
			}
		}
		else
		{
			keyPressedCtr=0;
		}
	}
	else
	{
		tamperTimer++;
		if(g_display_mode==0)
		{
			if(autoscrollInButtonMode!=0)
			{
				mode_timeout_ctr++;
				if(mode_timeout_ctr>59)	// 299
				{
					autoscrollInButtonMode=0;
					disp_timer=disp_autoscroll_interval;
				}
			}
		}
		else
		{
			if(g_display_mode==1)
			{
				mode_timeout_ctr++;
				if(mode_timeout_ctr>59)	// 299 
				{
					makeDisplayReadyForAutoScroll();
				}
			}
			else
			{// we are in high res mode
				mode_timeout_ctr++;
				if(mode_timeout_ctr>1799)	// 30 minutes
				{
					makeDisplayReadyForAutoScroll();
				}
			}
		}
	}
	
	if(init_done!=0){
		perSecondFlag=1;
	}
}

void CommunicationTimeoutCheck(void)
{
	if(comm_mode!=0)
	{
		commModeTimer++;
		if(commModeTimer>30)
		{
			commModeTimer=0;
			comm_mode=0;
		}
	}
}


#define MAX_STEP_ON_AUTOSCROLL_DISPLAY 21
#define MAX_STEP_ON_DEMAND_DISPLAY 10
#define MAX_STEP_ON_HIGH_RESOLUTION_DISPLAY 3

uint8_t mode_has_been_changed;
uint8_t fwdKeyPressed;
uint8_t revKeyPressed;
uint8_t someKeyPressed;

uint8_t fwdKeyPressedCtr;
uint8_t revKeyPressedCtr;
uint8_t bothKeysPressedCtr;
uint8_t noKeyPressedCtr;

uint8_t	fast_display_flag;
uint8_t	fast_display_counter;

uint8_t prevTopSW=1;
uint8_t prevMiddleSW=1;


void handleDisplay_Gujarat(uint8_t a);
void changeDisplayMode(void);
//void displayRepeatParameters(void);

void changeDisplayMode(void)
{// both keys have been pressed for some time
// 0 - autoscroll, 1 - displayOnDemand, 2 - High resolution display
	g_display_mode++;
	if(g_display_mode==3)	// this board now has High resolution display as requested by Shubham on 19/10/2023
	{
		g_display_mode=0;
		alt_autoscroll_mode=0;
		sub_disp_state=255;
		makeDisplayReadyForAutoScroll();
	}
	disp_state=255;
	disp_timer = 0;
	scrollLock=1;	// lock the display for a few seconds to allow following message to remain on LCD
// this variable gets cleared in 3 seconds	
	
  LCD_ClearAll();
	LCD_DisplayDigit(2, LCD_CHAR_M);
	LCD_DisplayDigit(3, 0);
	LCD_DisplayDigit(4, LCD_CHAR_D);
	LCD_DisplayDigit(5, LCD_CHAR_E);
	LCD_DisplayIntWithPos(g_display_mode+1, LCD_LAST_POS_DIGIT,0);
	mode_has_been_changed=1;
}

void handleKeyLogic(void)
{
	if(mode_has_been_changed!=0)
		return;
	
	if((fwdKeyPressed==1)&&(revKeyPressed==1))
	{
		bothKeysPressedCtr++;
		fwdKeyPressedCtr=0;
		revKeyPressedCtr=0;
		if(bothKeysPressedCtr>25)	// 125 earlier
		{
			changeDisplayMode();
			someKeyPressed=1;
			bothKeysPressedCtr=0;
			fwdKeyPressed=0;
			revKeyPressed=0;
		}
	}
	else
	{// here both switches may not be pressed or either switch may be pressed
		if((fwdKeyPressed==1)&&(revKeyPressed==0))
		{
			bothKeysPressedCtr=0;
			fwdKeyPressedCtr++;
			if(fwdKeyPressedCtr>4)	// 10 earlier
			{
				someKeyPressed=1;
				fwdKeyPressedCtr=0;
			}
		}
		else
		{// forward key is definitely not pressed
			fwdKeyPressedCtr=0;
			if((revKeyPressed==1)&&(fwdKeyPressed==0))
			{
				bothKeysPressedCtr=0;
				revKeyPressedCtr++;
				if(revKeyPressedCtr>4)	// 10 earlier
				{
					someKeyPressed=1;
					revKeyPressedCtr=0;
				}
			}
			else
			{// here no key has been pressed
				noKeyPressedCtr++;
				revKeyPressedCtr=0;
			}
		}
	}
}


void KEY_PollingProcessing(void)
{// Gujarat Board Key processing is different
// this routine is effectively executed every 40 ms
	uint8_t currentSW;

	if(init_done==0)	// 19/Aug/2020 - 17:00 - This is the correct thing
		return;
		
	if(kbscanflag==0)
		return;
		
	kbscanflag=0;
	
#ifdef KEY_ACTIVE_HIGH
	currentSW=~TOPSW;
#else
	currentSW=TOPSW;
#endif	
	if(currentSW==0)
	{// key is pressed
		if(prevTopSW==0)
		{
			fwdKeyPressed=1;
		}
	}
	else
	{// here key is not pressed
		if(prevTopSW!=0)
		{
			fwdKeyPressed=0;
		}
	}

	prevTopSW=currentSW;
//-----------------------------	
#ifdef KEY_ACTIVE_HIGH
	currentSW=~MIDDLESW;
#else
	currentSW=MIDDLESW;
#endif	
	
	if(currentSW==0)
	{
		if(prevMiddleSW==0)
		{
			revKeyPressed=1;
		}
	}
	else
	{// here key is not pressed
		if(prevMiddleSW!=0)
		{
			revKeyPressed=0;
		}
	}
	prevMiddleSW=currentSW;
	

// handle key logic

	handleKeyLogic();
	if(someKeyPressed==1)
		seconds_flag=1;	// this is to ensure entry into the handleDisplay function
		
	if(displayHold==0)
	{
		if(calswitch!=0)
			handleDisplay_Production();
		else
			handleDisplay_Gujarat(0);
	}

#ifdef KEY_ACTIVE_HIGH
	if(MDRST_SW!=0)	// switch is active high
#else
	if(MDRST_SW==0)	// switch is active low
#endif	
	{// key is pressed
		if(keyNotPressedCtr2>10)
		{// key has been released for at least half a second
			keyNotPressedCtr2=0;	// one has to release the key for the next press to be effective
		}
		else
		{//key continues to be pressed
			keyPressedCtr2++;	// increments every 40 ms
			if(keyPressedCtr2>50)
			{// key has been pressed for 2 seconds
				displayHold=1;	// this will prevent the display function to be called
			  LCD_ClearAll();
				LCD_DisplayDigit(2, LCD_CHAR_R);
				LCD_DisplayDigit(3, LCD_CHAR_E);
				LCD_DisplayDigit(4, 5);
				LCD_DisplayDigit(5, LCD_CHAR_E);
				LCD_DisplayDigit(6, LCD_CHAR_T);
	      generate_bill(rtc.date,rtc.month,rtc.year,rtc.hour,rtc.minute,rtc.second,BT_MANU);
	      write_alternately(CURRENT_MD_BASE_ADDRESS, ALTERNATE_CURRENT_MD_BASE_ADDRESS, (uint8_t*)&mymddata, sizeof(mymddata));
	      e2write_flags&=~E2_W_CURRENTDATA;
				keyPressedCtr2=0;	// this is to prevent reentry into mode 2
				gentimer=0;
			}
		}
	}
	else
	{// here key has been released
//		keyPressedCtr=0;
		keyNotPressedCtr2++;
		if(keyNotPressedCtr2>250)	// 10000 earlier
			keyNotPressedCtr2=250;
	}

