Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_MVVNL.c
	power_mode = POWERMGMT_GetMode();	// actual function to be used
		
	if (power_mode == POWERMGMT_MODE1)
	{
#ifdef BIDIR_METER		
		if((g_display_mode==0)&&(disp_state==47))
#else
		if(disp_state==0)
#endif
		{
		}
		else
			EM_LCD_DisplayStatus();
	}

	if((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) != 0)
	{
		if(g_display_mode==0)
			fast_display_flag=1;
	}
		
  if((disp_timer >= disp_autoscroll_interval)||(someKeyPressed==1)||(fast_display_flag==1))
	{
		seconds_flag=0;

		if(someKeyPressed==0)
		{
			if(g_display_mode==0)
			{
				if(autoscrollInButtonMode==0)
				{
					if(fast_display_flag==0)
					{
						if(holdState==0)
							disp_state++;
					}
					else
					{// here fast_display_flag = 1 - wait for autoscroll interval before incrementing state
						fast_display_counter++;
						if(fast_display_counter>disp_autoscroll_interval)
						{
							fast_display_flag=0;
							fast_display_counter=0;
							disp_state++;
						}
					}
				}
			}
			disp_timer=0;
		}
		else
		{// here some key has been pressed
			disp_timer=0;
			someKeyPressed=0;
			mode_timeout_ctr=0;
			fast_display_flag=0;
			
			if(fwdKeyPressed==1)
			{
				fwdKeyPressed=0;
				fwdKeyPressedCtr=0;
				if(g_display_mode==0)
				{
					if(autoscrollInButtonMode==0)
					{
						autoscrollInButtonMode=1;
						holdState=0;
					}
				}
				
				if(holdState==0)
					disp_state++;
			}
			
			if(revKeyPressed==1)
			{
				revKeyPressed=0;
				revKeyPressedCtr=0;
				
				if(g_display_mode==0)
				{
					if(autoscrollInButtonMode==0)
					{
						autoscrollInButtonMode=1;
						holdState=0;
					}
				}
				
				if(disp_state==0)
				{// we need to go to the last state
					switch(g_display_mode)
					{
						case 0:
							disp_state=23;	// last autoscroll state - 28 earlier , now 36
							break;
							
						case 1:
							disp_state=36;	// last pushbutton state - 34 earlier , now 36
							break;
							
						case 2:
							disp_state=3;	// last highres state
							break;
						
						default:
							break;
					}
				}
				else
				{
					disp_state--;
					holdState=0;
				}
			}
		}
		
		if(disp_autoscroll_interval>10)
			disp_autoscroll_interval=10;
		
			
		switch(g_display_mode)
		{
			case 0:	// autoscroll
				display_autoScroll();
				break;
				
			case 1:	// pushbutton
				display_onDemand();
				break;
				
			case 2:	// third display mode
				display_Third();
				break;
				
			default:
				makeDisplayReadyForAutoScroll();
				break;
		}
	}
}


//----------------------------------------------------------------------------------------------------------------------------------------
// this is for UNIDIR meter
uint32_t gTamperEvent;
//uint8_t g_tamper_display_state;
uint8_t g_cover_display_state;
uint8_t cover_disp_timer;

void displayCOPEN(void)
{// this function gets called every second if cover open is recorded
	ext_rtc_t datetime;

  R_WDT_Restart();
			
	cover_disp_timer++;
	if(cover_disp_timer>=5)
	{
		cover_disp_timer=0;
		g_cover_display_state++;	// this variable is made 255 when the tamper is registered
		
		if(g_cover_display_state>2)
			g_cover_display_state=0;
	}
	else
	{
		EM_LCD_DisplayStatus();
		return;
	}
		
// the actual display will be updated every 5 seconds
  LCD_ClearAll();	
	EM_LCD_DisplayStatus();

	switch(g_cover_display_state)
	{
		case 0:
			LCD_DisplayDigit(2, LCD_CHAR_C);
			LCD_DisplayDigit(3, LCD_MINUS_SIGN);
			LCD_DisplayDigit(4, 0);
			LCD_DisplayDigit(5, LCD_CHAR_P);
			LCD_DisplayDigit(6, LCD_CHAR_E);
			LCD_DisplayDigit(7, LCD_CHAR_N);
			break;
			
		case 1:	// show the date
			EPR_Read(EVENTS5_BASE_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_date(datetime.date,datetime.month,datetime.year);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, 0);
			break;
			
			
		case 2:	// show the time
			EPR_Read(EVENTS5_BASE_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, 0);
			break;
	}
}

void displayPrepare(void);

void displayPrepare(void)
{
  LCD_ClearAll();	
	if(disp_state<24)
		EM_LCD_DisplayStatus();
}

void display_autoScroll(void)
{
	float32_t tempFloat;
	int32_t tempTodKwh;
	int32_t tempLong;
	int32_t tempLong1;
	uint16_t tempTodMD;
	uint16_t tempint;
  int16_t i[EM_NUM_OF_LINE];
	
	ext_rtc_t datetime;
	EM_PF_SIGN pf_sign;    
	uint8_t tempchar;
	uint8_t tmonth;

  R_WDT_Restart();
	
	if(((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) != 0)&&(autoscrollInButtonMode==0))
	{
		displayCOPEN();		
		return;
	}
	
//  LCD_ClearAll();	// earlier when above was causing COPEN message to be displayed only once and then blank screen for 4 seconds
	if((comm_mode!=0)&&(autoscrollInButtonMode==0))
	{
		LCD_DisplayDigit(2, LCD_CHAR_D);
		LCD_DisplayDigit(3, LCD_CHAR_N);
		LCD_DisplayDigit(4, LCD_CHAR_L);
		LCD_DisplayDigit(5, LCD_CHAR_D);
		return;
	}
	
	if(disp_state>23)
		disp_state=0;

//	if(disp_state>0)
//		EM_LCD_DisplayStatus();
		
	switch(disp_state)
	{
    case 0:			// all on
      LCD_DisplayAll();
			fast_display_flag=0;
      break;
		
    case 1:		// meter number
    		  displayPrepare();
		  lcd_display_multiple_chars(0,6,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(Common_Data.meterNumber, LCD_LAST_POS_DIGIT,0);
			lcd_display_id();
			fast_display_flag=0;
     	break;
			
    case 2:		// time
     			displayPrepare();
			EM_DisplayInstantTime();
			fast_display_flag=1;
      break;

    case 3:		// date
     			displayPrepare();
			EM_DisplayDate();
			fast_display_flag=0;
      break;

    case 4:		// kWH
     		  displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
     break;
		 
    case 5:		// kVAH
     		  displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kvah/1000, LCD_LAST_POS_DIGIT,0);
//			display_long_one_dp(myenergydata.kvah/100);
//			display_long_three_dp(myenergydata.kvah);
			LCD_DisplaykVAhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
     break;
	 
