Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_MVVNL.c
    case 6:		// Current MD in kW
     		displayPrepare();
			display_long_three_dp(mymddata.mdkw);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_MD);
			fast_display_flag=0;
      break;
		 
    case 7:		// L1 - MD      tempchar = 1;
      tmonth = decrementMonth(1);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+96,(uint8_t*)&tempLong,4);
       displayPrepare();
      display_long_three_dp(tempLong);
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
			fast_display_flag=0;
      break;
		 
    case 8:		// Cumulative MD in kW
     			displayPrepare();
			display_long_three_dp(ctldata.cumulative_md);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_MD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 9:		// Current MD in kVA
     		displayPrepare();
			display_long_three_dp(mymddata.mdkva);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_MD);
			fast_display_flag=0;
      break;
		 
    case 10:		// L1 - MD      tempchar = 1;
      tmonth = decrementMonth(1);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+240,(uint8_t*)&tempLong,4);
      displayPrepare();
      display_long_three_dp(tempLong);
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_BILL);
			fast_display_flag=0;
      break;
		 
    case 11:		// Cumulative MD in kVA
     			displayPrepare();
			display_long_three_dp(ctldata.cumulative_md_kva);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_MD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 12:		// Instant Load in kW
			tempLong = getInstantaneousParams(ACT_POWER,LINE_TOTAL);
			 displayPrepare();
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplaykWSign();
			fast_display_flag=1;
	    break;

    case 13:		// billing count
    			displayPrepare();
			LCD_DisplayIntWithPos(Common_Data.bpcount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_P);
		  LCD_DisplaySpSign(S_D1);	// this will convert the P to R
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

			
    case 14:		// Total Tamper count
    			displayPrepare();
			LCD_DisplayIntWithPos(mytmprdata.tamperCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

    case 15:		// Existing tamper if any - last item
    			displayPrepare();
			d_Tampers();
			fast_display_flag=0;
      break;

   	case 16:		// average pf for current month
			tempLong = computeAveragePF(myenergydata.kwh, myenergydata.kvah,0,0, IMPORT);
			displayPrepare();
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(1, LCD_CHAR_A);
			LCD_DisplayDigit(2, LCD_CHAR_P);
			LCD_DisplayDigit(3, LCD_CHAR_F);
			fast_display_flag=0;
      break;
			
    case 17:		// Voltage - R
     			displayPrepare();
			tempLong = getInstantaneousParams(IVOLTS,LINE_PHASE_R)*100;
			display_long_two_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_R);
	   		LCD_DisplaySpSign(S_T2);	// V
			fast_display_flag=1;
      break;

    case 18:		// Voltage - Y
			 displayPrepare();
    			tempLong = getInstantaneousParams(IVOLTS,LINE_PHASE_Y)*100;
			display_long_two_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_Y);
	    LCD_DisplaySpSign(S_T2);	// V
			fast_display_flag=1;
      break;

    case 19:		// Voltage - B
     			displayPrepare();
			tempLong =getInstantaneousParams(IVOLTS,LINE_PHASE_B)*100;
			display_long_two_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_B);
	    LCD_DisplaySpSign(S_T2);	// V
			fast_display_flag=1;
	    break;

    case 20:		// Current - R with direction
     			displayPrepare();
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_R)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			lcd_display_A();
			fast_display_flag=1;
      break;

    case 21:		// Current - Y with direction
     			displayPrepare();
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_Y)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_Y);
			lcd_display_A();
			fast_display_flag=1;
      break;

   	case 22:		// Current - B with direction
	 		displayPrepare();
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_B)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_B);
			lcd_display_A();
			fast_display_flag=1;
      break;
			
    case 23:		// e2rom check , rtc check - Anomaly Display
     			displayPrepare();
			tempLong = maskTable[MISSING_POTENTIAL_R]|maskTable[MISSING_POTENTIAL_Y]|maskTable[MISSING_POTENTIAL_B];
			tempLong |= maskTable[OVER_VOLTAGE]|maskTable[UNDER_VOLTAGE]|maskTable[VOLTAGE_UNBALANCED];
			
			if((mytmprdata.tamperEvent_image&tempLong)==0)
			{// there are no voltage related tampers
				LCD_DisplayDigit(2, 1);
			}
			else
			{// there are voltage related tampers
				LCD_DisplayDigit(2, LCD_CHAR_V);
			}

			tempLong = maskTable[CT_REVERSED_R]|maskTable[CT_REVERSED_Y]|maskTable[CT_REVERSED_B];
			tempLong |= maskTable[CT_OPEN_R]|maskTable[CT_OPEN_Y]|maskTable[CT_OPEN_B];
			tempLong |= maskTable[CURRENT_UNBALANCED]|maskTable[CT_BYPASS]|maskTable[OVER_CURRENT];
			
			if((mytmprdata.tamperEvent_image&tempLong)==0)
			{// there are no current related tampers
				LCD_DisplayDigit(3, 1);
			}
			else
			{// there are current related tampers
				LCD_DisplayDigit(3, LCD_CHAR_C);
			}

			tempLong = maskTable[MAGNET]|maskTable[AC_MAGNET]|maskTable[NEUTRAL_DISTURBANCE]|maskTable[COVER_OPEN];
			
			if((mytmprdata.tamperEvent_image&tempLong)==0)
			{// there are no other tampers
				LCD_DisplayDigit(4, 1);
			}
			else
			{// there are other tampers
				LCD_DisplayDigit(4, LCD_CHAR_O);
			}
// now for rtc battery check - this is being made 1 always - better still remove it

			if(0==Common_Data.rtc_failed)
				LCD_DisplayDigit(5, 1);	// battery voltage is Not Low 
			else
				LCD_DisplayDigit(5, LCD_CHAR_B);	// battery voltage is Low
				
// now for E2rom check				
			tempchar=perform_E2ROM12_Test();
			if(tempchar==0)
			{// e2rom is good
				LCD_DisplayDigit(6, 1);	// e2rom is good
			}
			else
			{// E2ROM is failed
				LCD_DisplayDigit(6, LCD_CHAR_M);	// e2rom is failed
			}
			
			LCD_DisplayDigit(9, LCD_CHAR_A);
			LCD_DisplayDigit(8, LCD_CHAR_N);
			fast_display_flag=0;
      break;
	}
}

void display_onDemand(void)
{
//	toddata_t temptoddata;
	int32_t tempTodKwh;
  powermgmt_mode_t power_mode;
	int32_t tempLong;
	uint16_t tempint;
  int16_t i[EM_NUM_OF_LINE];
	ext_rtc_t datetime;
	EM_PF_SIGN pf_sign;    
	uint8_t tempchar;
	uint8_t tmonth;

  R_WDT_Restart();
  LCD_ClearAll();


