Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_MVVNL.c
    case 24:		// Instant Load in kVA
			tempLong = getInstantaneousParams(APP_POWER,LINE_TOTAL);
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplaykVASign();
			fast_display_flag=1;
	    break;

    case 25:		// total power on for L1
      tmonth = decrementMonth(1);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+384,(uint8_t*)&tempLong,4);
      LCD_DisplayIntWithPos(tempLong/60, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, 0);
			LCD_DisplayDigit(2, LCD_CHAR_N);
		  LCD_DisplaySpSign(S_BILL);
			LCD_DisplayDigit(9, LCD_CHAR_L);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
			
    case 26:		// total power on for L2
      tmonth = decrementMonth(2);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+384,(uint8_t*)&tempLong,4);
      LCD_DisplayIntWithPos(tempLong/60, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, 0);
			LCD_DisplayDigit(2, LCD_CHAR_N);
		  LCD_DisplaySpSign(S_BILL);
			LCD_DisplayDigit(9, LCD_CHAR_L);
			LCD_DisplayDigit(8, 2);
			fast_display_flag=0;
      break;
			
		case 27:
			d_Tampers();
			fast_display_flag=0;
      break;
			
		case 28:	// Last occured Tamper
			EPR_Read(LAST_OCCURED_DETAILS_ADDRESS+8,(uint8_t *)&tempchar,sizeof(tempchar));
			displayTamperName(tempchar);
			LCD_DisplayDigit(9, LCD_CHAR_O);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
		
		case 29:	// Last occured Tamper date
			EPR_Read(LAST_OCCURED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_date(datetime.date,datetime.month,datetime.year);
			LCD_DisplayDigit(9, LCD_CHAR_O);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
		
		case 30:	// Last occured Tamper time
			EPR_Read(LAST_OCCURED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_O);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
		
		case 31:	// Last restored Tamper
			EPR_Read(LAST_RESTORED_DETAILS_ADDRESS+8,(uint8_t *)&tempchar,sizeof(tempchar));
			displayTamperName(tempchar);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
		
		case 32:	// Last restored Tamper date
			EPR_Read(LAST_RESTORED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_date(datetime.date,datetime.month,datetime.year);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
		
		case 33:	// Last restored Tamper time
			EPR_Read(LAST_RESTORED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
		
    case 34:		// Total Tamper count
			LCD_DisplayIntWithPos(mytmprdata.tamperCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplayDigit(8, LCD_CHAR_C);	// 06/Sep/2020
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

		case 35:		// Phase Sequence - Voltage
			if((g_TamperStatus&MISSPOT_MASK)==0)
			{// here no potential is missing
				if(gPhaseSequence==0)
				{
					LCD_DisplayDigit(3, LCD_CHAR_R);
					LCD_DisplayDigit(4, LCD_CHAR_Y);
					LCD_DisplayDigit(5, LCD_CHAR_B);
				}
				else
				{
					LCD_DisplayDigit(3, LCD_CHAR_R);
					LCD_DisplayDigit(4, LCD_CHAR_B);
					LCD_DisplayDigit(5, LCD_CHAR_Y);
				}
			}
			else
			{// here some potential is missing
				LCD_DisplayDigit(3, LCD_MINUS_SIGN);
				LCD_DisplayDigit(4, LCD_MINUS_SIGN);
				LCD_DisplayDigit(5, LCD_MINUS_SIGN);
			}

 		 LCD_DisplayDigit(1, LCD_CHAR_V);
		 LCD_DisplayDigit(9, LCD_CHAR_P);
		 LCD_DisplayDigit(8, 5);
     break;

		case 36:		// Phase Sequence - Current
#ifdef CURRENT_PHASE_SEQUENCE		
		  i[LINE_PHASE_R] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_R)*100);
		  i[LINE_PHASE_Y] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_Y)*100);
		  i[LINE_PHASE_B] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_B)*100);

			tempchar = countCurrentGT145(i[LINE_PHASE_R],i[LINE_PHASE_Y],i[LINE_PHASE_B]);
			if(tempchar==3)
			{
				if(gPhaseSequenceCurrent==0)
				{
					LCD_DisplayDigit(3, LCD_CHAR_R);
					LCD_DisplayDigit(4, LCD_CHAR_Y);
					LCD_DisplayDigit(5, LCD_CHAR_B);
				}
				else
				{
					LCD_DisplayDigit(3, LCD_CHAR_R);
					LCD_DisplayDigit(4, LCD_CHAR_B);
					LCD_DisplayDigit(5, LCD_CHAR_Y);
				}
			}
			else
			{// here all currents are not greater than 1A
				LCD_DisplayDigit(3, LCD_MINUS_SIGN);
				LCD_DisplayDigit(4, LCD_MINUS_SIGN);
				LCD_DisplayDigit(5, LCD_MINUS_SIGN);
			}
#endif
	    LCD_DisplayDigit(1, LCD_CHAR_C);
	    LCD_DisplayDigit(9, LCD_CHAR_P);
	    LCD_DisplayDigit(8, 5);
     break;
	}
}

void display_Third(void)
{
	int32_t temp_high_res_energy;
	
  R_WDT_Restart();
  LCD_ClearAll();

	EM_LCD_DisplayStatus();

	if(disp_state==255)
		disp_state=0;
		
	if(disp_state>3)
		disp_state=0;
	
	switch(disp_state)
	{
    case 0:			// high resolution kwh
			temp_high_res_energy = ((myenergydata.kwh%100000)*100)+(int32_t)high_resolution_kwh_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykWhSign();
			fast_display_flag=1;
      break;
			
    case 1:			// high resolution kvah
			temp_high_res_energy = ((myenergydata.kvah%100000)*100)+(int32_t)high_resolution_kvah_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykVAhSign();
			fast_display_flag=1;
      break;
			
    case 2:			// high resolution kvarh lag
			temp_high_res_energy = ((myenergydata.kvarh_lag%100000)*100)+(int32_t)high_resolution_kvarh_lag_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykVArhSign();
    	LCD_DisplaySpSign(S_LAG);
			fast_display_flag=1;
      break;
			
    case 3:			// high resolution kvarh lead
			temp_high_res_energy = ((myenergydata.kvarh_lead%100000)*100)+(int32_t)high_resolution_kvarh_lead_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykVArhSign();
    	LCD_DisplaySpSign(S_LEAD);
			fast_display_flag=1;
      break;
	}
}

void d_Tampers(void)
{
	uint32_t whichevent;
	uint8_t event_code_bit;
	uint8_t whichGroup;

	if(holdState==0)
	{
		gTamperEvent = mytmprdata.tamperEvent_image&TAMPER_DISPLAY_MASK; // make all those bits not to be displayed as 0
		holdState = 1;
	}
	
