Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_MVVNL.c
	if(gTamperEvent==0)
	{// hereg_display_flag there are no tampers
		displayTamperName(0);	// 0 is to display the no tamper message
	}
	else
	{// here there is some tamper present i.e. some bits are 1
	// only those bits which are to be displayed have not been masked, transaction events and cover open etc have been masked out
    whichevent = gTamperEvent & ~(gTamperEvent-1);
		event_code_bit=findWhichBitIsOne(whichevent);	// bit numbers 1 to 15, 22, 23, 24, 29 and 30  - bit 0 is not used, others masked out
		displayTamperName(event_code_bit);
		gTamperEvent&=~whichevent;	// job complete for this fellow
	}
	
	if(gTamperEvent==0)
	{// everything has been completed
		holdState=0; 	// allow disp_state to be incremented
	}
// we are only showing the names of the occured tampers - date and time cases can be referred from TNEB code			
}



void EM_LCD_DisplayStatus(void)
{
  int16_t i[EM_NUM_OF_LINE];	// two decimals 

  powermgmt_mode_t power_mode;
	uint8_t blinkbit;
	
	power_mode = POWERMGMT_GetMode();

  i[LINE_PHASE_R] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_R)*100);	// 1Amp = 100
  i[LINE_PHASE_Y] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_Y)*100);
  i[LINE_PHASE_B] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_B)*100);

	
	if(i[LINE_PHASE_R]<0)
		i[LINE_PHASE_R]*=-1;
	if(i[LINE_PHASE_Y]<0)
		i[LINE_PHASE_Y]*=-1;
	if(i[LINE_PHASE_B]<0)
		i[LINE_PHASE_B]*=-1;
	
	if(g_display_mode==0)
	{
		if(((disp_state==0)||(disp_state==255))&&(alt_autoscroll_mode==1)&&(sub_disp_state==255))
		{
				return;
		}
	}

	if (power_mode == POWERMGMT_MODE3)
		return;

	if((gentimer%2)==0)
		blinkbit=0;
	else
		blinkbit=1;

// This is being done here since the icon could be forcibly cleared later on

// volt_unbalance
	if((fault_code&_BV(3))==0)
		LCD_ClearSpSign(S_V_UNBAL);
	else
		LCD_DisplaySpSign(S_V_UNBAL);

// handling of RYB		
// If voltage and current are available then RYB to be displayed continuously.
// If only voltage is available then the particular phase icon should blink.
// If voltage is not available – then icon should disappear.
	
	if((fault_code&_BV(0))!=0)
	{
		LCD_ClearSpSign(S_R);
//		LCD_ClearSpSign(S_V_UNBAL);
	}
	else
	{// here voltage is available
		if(i[LINE_PHASE_R]>10)
			LCD_DisplaySpSign(S_R);	// current is also available
		else
		{// blink
			if(blinkbit==0)
				LCD_ClearSpSign(S_R);
			else
				LCD_DisplaySpSign(S_R);
		}
	}

	if((fault_code&_BV(1))!=0)
	{
		LCD_ClearSpSign(S_Y);
//		LCD_ClearSpSign(S_V_UNBAL);
	}
	else
	{// here voltage is available
		if(i[LINE_PHASE_Y]>10)
			LCD_DisplaySpSign(S_Y);	// current is also available
		else
		{// blink
			if(blinkbit==0)
				LCD_ClearSpSign(S_Y);
			else
				LCD_DisplaySpSign(S_Y);
		}
	}

	if((fault_code&_BV(2))!=0)
	{
		LCD_ClearSpSign(S_B);
//		LCD_ClearSpSign(S_V_UNBAL);
	}
	else
	{// here voltage is available
		if(i[LINE_PHASE_B]>10)
			LCD_DisplaySpSign(S_B);	// current is also available
		else
		{// blink
			if(blinkbit==0)
				LCD_ClearSpSign(S_B);
			else
				LCD_DisplaySpSign(S_B);
		}
	}
	
// Rev_R(6), Rev_Y(7), Rev_B(8) - no icons  in BIDIR mode		
// Here we are in Unidir Mode	
	if((g_TamperStatus&REVERSE_MASK)!=0)
		LCD_DisplaySpSign(S_LEFT_ARROW);
	else
		LCD_ClearSpSign(S_LEFT_ARROW);

// Neutral Disturbance(9) - If neutral disturbance N icon will blink
	if((fault_code&_BV(9))!=0)
	{
		if((gentimer%2)==0)
			LCD_ClearSpSign(S_N);
		else
			LCD_DisplaySpSign(S_N);
			
//		LCD_ClearSpSign(S_V_UNBAL);
	}
	else
	{// here there is no tamper - neutral is proper
		LCD_DisplaySpSign(S_N);		
	}	
// over current and ct open have no indication		
// for over current let the corresponding R Y B icon blink - let it be for present
		
// for CT-open use the MISS icon S_NM

	if(((fault_code&_BV(11))!=0)||((fault_code&_BV(12))!=0)||((fault_code&_BV(13))!=0))
    LCD_DisplaySpSign(S_NM);
	else
    LCD_ClearSpSign(S_NM);

// magnet tamper
//	if(((fault_code&_BV(10))==0)&&((fault_code&_BV(15))==0))

//	if(((fault_code&_BV(10))!=0)||((fault_code&_BV(14))!=0))
//	if(((g_TamperStatus&HALLSENS_MASK)!=0)||((g_TamperStatus&ACMAG_MASK)!=0))
//		LCD_DisplaySpSign(S_MAG);
//	else
//		LCD_ClearSpSign(S_MAG);


//	if(((g_TamperStatus&HALLSENS_MASK)==0)&&((g_TamperStatus&ACMAG_MASK)==0))
	if(((g_TamperStatus&HALLSENS_MASK)==0)&&(pulsesStartedComingFlag==0))
	{
		LCD_ClearSpSign(S_MAG);
		
// current bypass
		if(((fault_code&_BV(4))==0)||((g_TamperStatus&CTOPEN_MASK)!=0))
			LCD_ClearSpSign(S_T9);
		else
			LCD_DisplaySpSign(S_T9);

// current_unbalance
		if((fault_code&_BV(5))==0)
			LCD_ClearSpSign(S_C_UNBAL);
		else
			LCD_DisplaySpSign(S_C_UNBAL);
	}
	else
	{
		LCD_DisplaySpSign(S_MAG);
		LCD_ClearSpSign(S_T9);			// Bypass
		LCD_ClearSpSign(S_C_UNBAL);	// Current Unbalance
    LCD_ClearSpSign(S_NM);	// CT Open
//		LCD_ClearSpSign(S_LEFT_ARROW);
	}
	
// this is the last thing to be done
// if there is missing potential or neutral disturbanc or mixed powers then Bypass, Current Unbalance, CT open icons to be
// switched off


	if(((fault_code&_BV(0))!=0)||((fault_code&_BV(1))!=0)||((fault_code&_BV(2))!=0)||((fault_code&_BV(9))!=0)||(mixedPowers==1))
//	if(((fault_code&_BV(0))!=0)||((fault_code&_BV(1))!=0)||((fault_code&_BV(2))!=0)||((fault_code&_BV(9))!=0)||((g_TamperStatus&REVERSE_MASK)!=0))
	{
		LCD_ClearSpSign(S_T9);			// Bypass
		LCD_ClearSpSign(S_C_UNBAL);	// Current Unbalance
    LCD_ClearSpSign(S_NM);	// CT Open
//		LCD_ClearSpSign(S_LEFT_ARROW);
	}
}

void displayTamperName(uint8_t eventCode)
{
		switch(eventCode)
//		switch(mytmprdata.latestTamperCode)	// this is obviously wrong
		{
			case 0:
				lcd_msg((const uint8_t*)&msg_nil_tamper);
				break;
				
			case 1:	//	MISSING_POTENTIAL_R
				lcd_msg((const uint8_t*)&msg_miss_R);
				break;
			
			case 2:	//	MISSING_POTENTIAL_Y
				lcd_msg((const uint8_t*)&msg_miss_Y);
				break;
				
			case 3:	//	MISSING_POTENTIAL_B
				lcd_msg((const uint8_t*)&msg_miss_B);
				break;
				
			case 4:	//	OVER_VOLTAGE
				lcd_msg((const uint8_t*)&msg_over_V);
				break;
			
			case 5:	//	UNDER_VOLTAGE
				lcd_msg((const uint8_t*)&msg_under_V);
				break;

			case 6:	//	VOLTAGE_UNBALANCED
				lcd_msg((const uint8_t*)&msg_unbal_V);
				break;

			case 7:	//	CT_REVERSED_R
				lcd_msg((const uint8_t*)&curr_rev_R);
				break;
				
			case 8:	//	CT_REVERSED_Y
				lcd_msg((const uint8_t*)&curr_rev_Y);
				break;
				
			case 9:	//	CT_REVERSED_B
				lcd_msg((const uint8_t*)&curr_rev_B);
				break;

 			case 10:	//	CT_OPEN_R
				lcd_msg((const uint8_t*)&curr_fail_R);
				break;
			case 11:	//	CT_OPEN_Y
				lcd_msg((const uint8_t*)&curr_fail_Y);
				break;
			case 12:	//	CT_OPEN_B
				lcd_msg((const uint8_t*)&curr_fail_B);
				break;

			case 13:	//	CURRENT_UNBALANCED
				lcd_msg((const uint8_t*)&msg_unbal_C);
				break;
				
			case 14:	//	CT_BYPASS
				lcd_msg((const uint8_t*)&msg_bypass_C);
				break;
				
			case 15:	//	OVER_CURRENT
				lcd_msg((const uint8_t*)&msg_over_C);
				break;
			
			case 16:	//	POWER_EVENT
			case 17:	//	RTC_TRANSACTION
			case 18:	//	MD_INTERVAL_TRANSACTION
			case 19:	//	SURVEY_INTERVAL_TRANSACTION
			case 20:	//	SINGLE_ACTION_TRANSACTION
			case 21:	//	ACTIVITY_CALENDAR_TRANSACTION
			case 25:	//	LOW_PF
				break;
				
			case 26:	//	COVER_OPEN
				lcd_msg((const uint8_t*)&msg_C_Open);
				break;
			case 27:	//	MODE_UNIDIRECTIONAL_SET
			case 28:	//	MODE_BIDIRECTIONAL_SET
				break;

			case 22:	//	MAGNET
			case 23:	//	AC_MAGNET
				lcd_msg((const uint8_t*)&msg_Magnet);
				break;
			case 24:	//	NEUTRAL_DISTURBANCE
				lcd_msg((const uint8_t*)&msg_ND);
				break;
			
			case 29:	//	OVER_CURRENT_Y
			case 30:	//	OVER_CURRENT_B
			
			default:
				break;
		}

}


















